import Head from 'next/head';
import Link from 'next/link';
import {Section} from '../components/Section';

const Home = () => <>
    <Head>
        <title>伊藤 慶 - Kei Ito</title>
        <meta name="description" content="伊藤 慶 (Kei Ito) について"/>
    </Head>
    <main>
        <Section title="Section Title" id="section1">
            <p><Link href="./2021/nextjs"><a>2021/nextjs</a></Link></p>
            <p>教員が控所へ揃うには一時間目の喇叭が鳴らなくてはならぬ。大分時間がある。校長は時計を出して見て、追々ゆるりと話すつもりだが、まず大体の事を呑み込んでおいてもらおうと云って、それから教育の精神について長いお談義を聞かした。おれは無論いい加減に聞いていたが、途中からこれは飛んだ所へ来たと思った。</p>
            <p>校長の云うようにはとても出来ない。おれみたような無鉄砲なものをつらまえて、生徒の模範になれの、一校の師表と仰がれなくてはいかんの、学問以外に個人の徳化を及ぼさなくては教育者になれないの、と無暗に法外な注文をする。そんなえらい人が月給四十円で遥々こんな田舎へくるもんか。人間は大概似たもんだ。腹が立てば喧嘩の一つぐらいは誰でもするだろうと思ってたが、この様子じゃめったに口も聞けない、散歩も出来ない。そんなむずかしい役なら雇う前にこれこれだと話すがいい。おれは嘘をつくのが嫌いだから、仕方がない、だまされて来たのだとあきらめて、思い切りよく、ここで断わって帰っちまおうと思った。</p>
            <p>宿屋へ五円やったから財布の中には九円なにがししかない。九円じゃ東京までは帰れない。茶代なんかやらなければよかった。惜しい事をした。しかし九円だって、どうかならない事はない。旅費は足りなくっても嘘をつくよりましだと思って、到底あなたのおっしゃる通りにゃ、出来ません、この辞令は返しますと云ったら、校長は狸のような眼をぱちつかせておれの顔を見ていた。やがて、今のはただ希望である、あなたが希望通り出来ないのはよく知っているから心配しなくってもいいと云いながら笑った。そのくらいよく知ってるなら、始めから威嚇さなければいいのに。</p>
        </Section>
        <Section title="教員が控所へ揃うには一時間目の喇叭が鳴らなくてはならぬ教員が控所へ揃うには一時間目の喇叭が鳴らなくてはならぬ" id="section2">
            <p>教員が控所へ揃うには一時間目の喇叭が鳴らなくてはならぬ。大分時間がある。校長は時計を出して見て、追々ゆるりと話すつもりだが、まず大体の事を呑み込んでおいてもらおうと云って、それから教育の精神について長いお談義を聞かした。おれは無論いい加減に聞いていたが、途中からこれは飛んだ所へ来たと思った。</p>
            <p>校長の云うようにはとても出来ない。おれみたような無鉄砲なものをつらまえて、生徒の模範になれの、一校の師表と仰がれなくてはいかんの、学問以外に個人の徳化を及ぼさなくては教育者になれないの、と無暗に法外な注文をする。そんなえらい人が月給四十円で遥々こんな田舎へくるもんか。人間は大概似たもんだ。腹が立てば喧嘩の一つぐらいは誰でもするだろうと思ってたが、この様子じゃめったに口も聞けない、散歩も出来ない。そんなむずかしい役なら雇う前にこれこれだと話すがいい。おれは嘘をつくのが嫌いだから、仕方がない、だまされて来たのだとあきらめて、思い切りよく、ここで断わって帰っちまおうと思った。</p>
            <p>宿屋へ五円やったから財布の中には九円なにがししかない。九円じゃ東京までは帰れない。茶代なんかやらなければよかった。惜しい事をした。しかし九円だって、どうかならない事はない。旅費は足りなくっても嘘をつくよりましだと思って、到底あなたのおっしゃる通りにゃ、出来ません、この辞令は返しますと云ったら、校長は狸のような眼をぱちつかせておれの顔を見ていた。やがて、今のはただ希望である、あなたが希望通り出来ないのはよく知っているから心配しなくってもいいと云いながら笑った。そのくらいよく知ってるなら、始めから威嚇さなければいいのに。</p>
        </Section>
        <Section id="section3">
            <p>教員が控所へ揃うには一時間目の喇叭が鳴らなくてはならぬ。大分時間がある。校長は時計を出して見て、追々ゆるりと話すつもりだが、まず大体の事を呑み込んでおいてもらおうと云って、それから教育の精神について長いお談義を聞かした。おれは無論いい加減に聞いていたが、途中からこれは飛んだ所へ来たと思った。</p>
            <p>校長の云うようにはとても出来ない。おれみたような無鉄砲なものをつらまえて、生徒の模範になれの、一校の師表と仰がれなくてはいかんの、学問以外に個人の徳化を及ぼさなくては教育者になれないの、と無暗に法外な注文をする。そんなえらい人が月給四十円で遥々こんな田舎へくるもんか。人間は大概似たもんだ。腹が立てば喧嘩の一つぐらいは誰でもするだろうと思ってたが、この様子じゃめったに口も聞けない、散歩も出来ない。そんなむずかしい役なら雇う前にこれこれだと話すがいい。おれは嘘をつくのが嫌いだから、仕方がない、だまされて来たのだとあきらめて、思い切りよく、ここで断わって帰っちまおうと思った。</p>
            <p>宿屋へ五円やったから財布の中には九円なにがししかない。九円じゃ東京までは帰れない。茶代なんかやらなければよかった。惜しい事をした。しかし九円だって、どうかならない事はない。旅費は足りなくっても嘘をつくよりましだと思って、到底あなたのおっしゃる通りにゃ、出来ません、この辞令は返しますと云ったら、校長は狸のような眼をぱちつかせておれの顔を見ていた。やがて、今のはただ希望である、あなたが希望通り出来ないのはよく知っているから心配しなくってもいいと云いながら笑った。そのくらいよく知ってるなら、始めから威嚇さなければいいのに。</p>
        </Section>
    </main>
</>;

export default Home;
